<!-- dflook/terraform-github-actions {"workspace":"tvm-ci-prod","backend":"5e8bb606b38cc85759a39879179a6030f8b45bacaa9096ac7b1d9460f54ff00f","backend_type":"s3"} -->
Terraform plan in __.__ in the __tvm-ci-prod__ workspace
With var files: `vars/tvm-ci-prod.auto.tfvars
`
<details>
<summary>Plan: 3 to add, 1 to change, 3 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.head_node.aws_eip.static will be updated in-place
  ~ resource "aws_eip" "static" {
        id                   = "eipalloc-09507c4c36cba0933"
      ~ instance             = "i-0ac32f53a6b366a0e" -> (known after apply)
        tags                 = {
            "Name" = "eip-jenkins-server-prod"
        }
        # (12 unchanged attributes hidden)
    }

  # module.head_node.aws_instance.jenkins_head_node must be replaced
-/+ resource "aws_instance" "jenkins_head_node" {
      ~ arn                                  = "arn:aws:ec2:us-west-2:477529581014:instance/i-0ac32f53a6b366a0e" -> (known after apply)
      ~ associate_public_ip_address          = true -> (known after apply)
      ~ availability_zone                    = "us-west-2a" -> (known after apply)
      ~ cpu_core_count                       = 8 -> (known after apply)
      ~ cpu_threads_per_core                 = 2 -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "*******************" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "*********************" -> (known after apply)
      ~ private_dns                          = "ip-10-100-192-214.us-west-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.100.192.214" -> (known after apply)
      ~ public_dns                           = "ec2-54-184-159-219.us-west-2.compute.amazonaws.com" -> (known after apply)
      ~ public_ip                            = "54.184.159.219" -> (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
        tags                                 = {
            "Environment" = "title(var.environment)"
            "Name"        = "Prod-Jenkins-Head-Node"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "6943aab2ad9d4941543300edb36e0ce4bca1a3ff" -> "bfad437f5d4a02b60f0cc18f80dafd9194869454" # forces replacement
      + user_data_base64                     = (known after apply)
        # (9 unchanged attributes hidden)

      ~ capacity_reservation_specification {
          ~ capacity_reservation_preference = "open" -> (known after apply)

          + capacity_reservation_target {
              + capacity_reservation_id = (known after apply)
            }
        }

      - credit_specification {
          - cpu_credits = "unlimited" -> null
        }

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sdf" -> null
          - encrypted             = false -> null
          - iops                  = 1500 -> null
          - tags                  = {
              - "Name" = "Prod-Jenkins-Persistent-Storage"
            } -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-07cbe57bb0255fbf0" -> null
          - volume_size           = 500 -> null
          - volume_type           = "gp2" -> null
        }

      ~ enclave_options {
          ~ enabled = false -> (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      ~ metadata_options {
          ~ http_endpoint               = "enabled" -> (known after apply)
          ~ http_put_response_hop_limit = 1 -> (known after apply)
          ~ http_tokens                 = "********" -> (known after apply)
          ~ instance_metadata_tags      = "disabled" -> (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      ~ root_block_device {
          ~ device_name           = "/dev/sda1" -> (known after apply)
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 1500 -> (known after apply)
          + kms_key_id            = (known after apply)
          - tags                  = {} -> null
          ~ throughput            = 0 -> (known after apply)
          ~ volume_id             = "*********************" -> (known after apply)
          ~ volume_type           = "gp2" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.head_node.aws_lb_target_group_attachment.head_node must be replaced
-/+ resource "aws_lb_target_group_attachment" "head_node" {
      ~ id               = "**********************************************************************************************************************" -> (known after apply)
      ~ target_id        = "*******************" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.head_node.aws_volume_attachment.jobs_storage must be replaced
-/+ resource "aws_volume_attachment" "jobs_storage" {
      ~ id          = "**************" -> (known after apply)
      ~ instance_id = "*******************" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.
```
</details>

:memo: Plan generated in [terraform #161](https://github.com/tlc-pack/ci-terraform/actions/runs/2398938372)